Revit 2027 API
RebarBendData.HookLength1 Property
 The extension length of the hook at the end. The default value is 0.0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HookLength1 { get; set; }
Public Property HookLength1 As Double
	Get
	Set
public:
property double HookLength1 {
	double get ();
	void set (double value);
}
member HookLength1 : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for hookLength1 is not finite
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace